#include <iostream>

#define 𐌷𐌰𐌱𐌰𐌽 using
#define 𐌽𐌰𐌼𐍉·𐍂𐌿𐌼𐌹𐍃 namespace
#define 𐍃𐍄𐌳 std

#define 𐌻𐌰𐌿𐍃 void
#define 𐌷𐌰𐌹𐌻𐍃 int
#define 𐌳𐌰𐌹𐌻𐍃 float
#define 𐍄𐌰𐌹𐌺𐌽𐍃 char
#define 𐌹𐌽𐌿𐌷·𐌱𐌰𐌽𐌳𐍅𐌰𐍃 unsigned

#define 𐌵𐌹𐌸𐌰𐌽 cout
#define 𐌲𐌰𐌼𐌴𐌻𐌾𐌰𐌽 cin
#define 𐌰𐌽𐌳𐌴𐌹𐍃 endl
#define 𐍆𐍂𐌿𐌼𐌰 main

#define 𐌰𐍄𐌲𐌹𐌱𐌰𐌽 return
#define 𐌱𐍂𐌹𐌺𐌰𐌽 break
#define 𐌾𐌰𐌱𐌰𐌹 if
#define 𐌽𐌹𐌱𐌰𐌹 else
#define 𐌽𐌹 not
#define 𐌾𐌰𐌷 and
#define 𐌾𐌰𐌷 &&
#define 𐌸𐌰𐌿 or
#define 𐌸𐌰𐌿 ||
#define 𐌸𐌰𐌽𐌳𐌴 while
#define 𐌸𐌰𐌹𐍂𐌷 for

#define 𐌰 "a"
#define 𐌱 "b"
#define 𐌲 "g"
#define 𐌳 "d"
#define 𐌴 "e"
#define 𐌵 "q"
#define 𐌶 "z"
#define 𐌷 "h"
#define 𐌸 "th"
#define 𐌹 "i"
#define 𐌺 "k"
#define 𐌻 "l"
#define 𐌼 "m"
#define 𐌽 "n"
#define 𐌾 "j"
#define 𐌿 "u"
#define 𐍀 "p"
#define 𐍂 "r"
#define 𐍃 "s"
#define 𐍄 "t"
#define 𐍅 "w"
#define 𐍆 "f"
#define 𐍇 "x"
#define 𐍈 "hw"
#define 𐍉 "o"
#define · "."
#define ·· << " " <<
#define ·𐍊 "!"
#define ·𐍁 "?"


𐌷𐌰𐌱𐌰𐌽 𐌽𐌰𐌼𐍉·𐍂𐌿𐌼𐌹𐍃 𐍃𐍄𐌳;

𐌷𐌰𐌹𐌻𐍃 𐍆𐍂𐌿𐌼𐌰()
{   
    𐌷𐌰𐌹𐌻𐍃 𐍄𐍅𐌰𐌹 = 2;
    𐌵𐌹𐌸𐌰𐌽 << 𐌷 𐌰 𐌹 𐌻 𐍃 ·· 𐍆 𐌰 𐌹 𐍂 𐍈 𐌿 𐍃 ·𐍊 << 𐌰𐌽𐌳𐌴𐌹𐍃;
    𐌵𐌹𐌸𐌰𐌽 << 𐍄 𐍅 𐌰 𐌹 ·· 𐌹 𐍃 𐍄 ·· 𐍄𐍅𐌰𐌹 << 𐌰𐌽𐌳𐌴𐌹𐍃;

    𐌰𐍄𐌲𐌹𐌱𐌰𐌽 0;
}

/*
using -> 𐌷𐌰𐌱𐌰𐌽 (иметь)
namespace -> 𐌽𐌰𐌼𐍉 (имя) + 𐍂𐌿𐌼𐌹𐍃 (место)
std -> 𐍃𐍄𐌳

void -> 𐌻𐌰𐌿𐍃 (пустой)
char -> 𐍄𐌰𐌹𐌺𐌽𐍃 (знак, чудо(???))
int -> 𐌷𐌰𐌹𐌻𐍃 (целый)
float -> 𐌳𐌰𐌹𐌻𐍃 (часть)

unsigned -> 𐌹𐌽𐌿𐌷·𐌱𐌰𐌽𐌳𐍅𐌰𐍃 (без + знаковый(предположительный перевод, 𐌱𐌰𐌽𐌳𐍅𐌰 -> знак))

main -> 𐍆𐍂𐌿𐌼𐌰 (первый)
cout -> 𐌵𐌹𐌸𐌰𐌽 (сказать)
cin -> 𐌲𐌰𐌼𐌴𐌻𐌾𐌰𐌽 (написать)
endl -> 𐌰𐌽𐌳𐌴𐌹𐍃 (конец)

return -> 𐌰𐍄𐌲𐌹𐌱𐌰𐌽 (отдавать)
break -> 𐌱𐍂𐌹𐌺𐌰𐌽 (ломать)
if -> 𐌾𐌰𐌱𐌰𐌹 (если)
else -> 𐌽𐌹𐌱𐌰𐌹 (если не, кроме, разве)
not -> 𐌽𐌹 (не)
and -> 𐌾𐌰𐌷 (и)
or -> 𐌸𐌰𐌿 (или)
while -> 𐌸𐌰𐌽𐌳𐌴 (до тех пор, пока, если, когда)
for -> 𐌸𐌰𐌹𐍂𐌷 (для, благодаря, через)
*/
